# Tarea: Análisis de Datos de una Escuela

### Descripción del Dataset

Tienes tres datasets en formato CSV:
- `estudiantes.csv`: Información sobre los estudiantes.
  - Columnas: `student_id`, `student_name`, `age`
- `cursos.csv`: Información sobre los cursos.
  - Columnas: `course_id`, `course_name`, `credits`, `professor`
- `notas.csv`: Información sobre las notas de los estudiantes en los cursos.
  - Columnas: `note_id`, `student_id`, `course_id`, `grade`

Puntaje:

### 1. Cargar y mostrar los datos (1 pts)

Carga los archivos CSV en dataframes de pandas y muestra las primeras filas de cada uno.

In [4]:
import numpy as np
import pandas as pd

df_estudiantes = pd.read_csv('estudiantes.csv')
df_cursos = pd.read_csv('cursos.csv')
df_notas = pd.read_csv('notas.csv')

#df_estudiantes

     student_id    student_name  age     gender
0             1             NaN   -5  Masculino
1             2    Estudiante 2   10   Femenino
2             3    Estudiante 3   18   Femenino
3             4    Estudiante 4   21   Femenino
4             5    Estudiante 5   21   Femenino
..          ...             ...  ...        ...
195         196  Estudiante 196   22  Masculino
196         197  Estudiante 197   21  Masculino
197         198             NaN   23   Femenino
198         199  Estudiante 199   21  Masculino
199         200  Estudiante 200   22  Masculino

[200 rows x 4 columns]

### 2. Limpieza de Datos (3 pts)

#### a. Estudiantes
1. Eliminar registros con nombres vacíos.
2. Eliminar registros con edades fuera del rango (18-25).

In [8]:
df_estudiantes = df_estudiantes[df_estudiantes['student_name'].notnull()]
#df_estudiantes
df_estudiantes = df_estudiantes[(df_estudiantes['age'] >= 18) & (df_estudiantes['age'] <= 25)]
#df_estudiantes

     student_id    student_name  age     gender
2             3    Estudiante 3   18   Femenino
3             4    Estudiante 4   21   Femenino
4             5    Estudiante 5   21   Femenino
5             6    Estudiante 6   21  Masculino
6             7    Estudiante 7   19  Masculino
..          ...             ...  ...        ...
194         195  Estudiante 195   18  Masculino
195         196  Estudiante 196   22  Masculino
196         197  Estudiante 197   21  Masculino
198         199  Estudiante 199   21  Masculino
199         200  Estudiante 200   22  Masculino

[164 rows x 4 columns]

#### b. Cursos
1. Eliminar registros con nombres de cursos vacíos.
2. Eliminar registros con créditos fuera del rango (1-5).

In [11]:
#df_cursos
df_cursos = df_cursos[df_cursos['course_name'].notnull()]
df_cursos = df_cursos[(df_cursos['credits'] >= 1) & (df_cursos['credits'] <= 5)]
df_cursos

    course_id course_name  credits     professor
0           1     Curso 1        1    Profesor 1
2           3     Curso 3        1    Profesor 3
3           4     Curso 4        1    Profesor 4
4           5     Curso 5        4    Profesor 5
5           6     Curso 6        4    Profesor 6
..        ...         ...      ...           ...
94         95    Curso 95        2   Profesor 95
96         97    Curso 97        2   Profesor 97
97         98    Curso 98        2   Profesor 98
98         99    Curso 99        3   Profesor 99
99        100   Curso 100        3  Profesor 100

[82 rows x 4 columns]

#### c. Notas
1. Eliminar registros con notas fuera del rango (0-10).
2. Eliminar registros con `student_id` y `course_id` que no existen en las tablas de estudiantes y cursos respectivamente.

In [18]:
#df_notas
df_notas = df_notas[(df_notas['grade'] >= 0) & (df_notas['grade'] <= 10)]
df_notas = df_notas[df_notas['student_id'].isin(df_estudiantes['student_id'])]
df_notas = df_notas[df_notas['course_id'].isin(df_cursos['course_id'])]
df_notas

     grade_id  student_id  course_id  grade
0           1         168         16   8.00
1           2         137         19   3.11
4           5          23         61   1.38
5           6          80         43   1.94
6           7           9         83   4.81
..        ...         ...        ...    ...
993       994          48         18   6.04
994       995          82          6   6.62
996       997         200         64   8.70
997       998          54         28   9.93
998       999         199         42   7.64

[559 rows x 4 columns]

### 3. Estadísticas (3 pts)

1. Calcular la media, mediana y desviación estándar de las edades de los estudiantes.
2. Calcular la media, mediana y desviación estándar de los créditos de los cursos.
3. Calcular la media, mediana y desviación estándar de las notas de los estudiantes.

In [27]:
result_edades_estudiantes = df_estudiantes['age'].agg(['mean', 'median', 'std'])
result_creditos_cursos = df_cursos['credits'].agg(['mean', 'median', 'std'])
result_notas_estudiantes = df_notas['grade'].agg(['mean', 'median', 'std'])
result_notas_estudiantes

mean      4.854544
median    4.790000
std       2.866402
Name: grade, dtype: float64

### 4. Uniones/ Joins (3 pts)

1. Unir las notas con los estudiantes para obtener el nombre y la edad del estudiante en cada nota.
2. Unir las notas con los cursos para obtener el nombre del curso y el profesor en cada nota.

In [31]:
df_notas
df_estudiantes

     student_id    student_name  age     gender
2             3    Estudiante 3   18   Femenino
3             4    Estudiante 4   21   Femenino
4             5    Estudiante 5   21   Femenino
5             6    Estudiante 6   21  Masculino
6             7    Estudiante 7   19  Masculino
..          ...             ...  ...        ...
194         195  Estudiante 195   18  Masculino
195         196  Estudiante 196   22  Masculino
196         197  Estudiante 197   21  Masculino
198         199  Estudiante 199   21  Masculino
199         200  Estudiante 200   22  Masculino

[162 rows x 4 columns]

### 5. Filtros (5 pts)

1. Filtrar las notas de estudiantes entre 20 y 22 años.
2. Filtrar las notas en cursos con más de 3 créditos.
3. Filtrar las notas obtenidas por un estudiante específico (ejemplo: `student_id` = 1) y en un curso específico (ejemplo: `course_id` = 1).

### 6. Agregaciones (5 pts)

1. Calcular el promedio de notas por cada estudiante.
2. Calcular el promedio de notas por cada curso.
3. Calcular el promedio de notas por cada profesor.
4. Calcular el número total de estudiantes por curso.
5. Calcular el número total de cursos por profesor.